Repository: darcdev/urbanAI
Catalog: backend/Urban.AI/src/Urban.AI.Domain/Incidents/Resources/IncidentResources.*.resx
Languages: es

# IncidentNotFound
source: The incident was not found.
es: El incidente no fue encontrado.

# IncidentImageRequired
source: The incident image is required.
es: La imagen del incidente es requerida.

# IncidentLocationRequired
source: The incident location is required.
es: La ubicación del incidente es requerida.

# IncidentInvalidImageFormat
source: The incident image format is invalid. Only JPEG and PNG formats are allowed.
es: El formato de la imagen del incidente es inválido. Solo se permiten formatos JPEG y PNG.

# IncidentImageTooLarge
source: The incident image is too large. Maximum size allowed is {0} MB.
es: La imagen del incidente es demasiado grande. El tamaño máximo permitido es {0} MB.

# IncidentAnalysisFailed
source: Failed to analyze the incident image.
es: Falló el análisis de la imagen del incidente.

# IncidentNoLeaderAvailable
source: No leader available for the incident location.
es: No hay líder disponible para la ubicación del incidente.

# IncidentInvalidEmail
source: The email address is invalid.
es: La dirección de correo electrónico es inválida.

# IncidentMunicipalityNotFound
source: The municipality was not found for the provided location.
es: El municipio no fue encontrado para la ubicación proporcionada.

# IncidentImageStreamRequired
source: Image stream is required.
es: El flujo de imagen es requerido.

# IncidentImageFilenameRequired
source: Image filename is required.
es: El nombre del archivo de imagen es requerido.

# IncidentInvalidLatitude
source: Latitude must be between -90 and 90.
es: La latitud debe estar entre -90 y 90.

# IncidentInvalidLongitude
source: Longitude must be between -180 and 180.
es: La longitud debe estar entre -180 y 180.

# IncidentCommentTooLong
source: Additional comment must not exceed 500 characters.
es: El comentario adicional no debe exceder los 500 caracteres.
