Repository: darcdev/urbanAI
Catalog: backend/Urban.AI/src/Urban.AI.Infrastructure/Storage/Resources/StorageResources.*.resx
Languages: es

# FileNotFound
source: File not found in storage
es: Archivo no encontrado en el almacenamiento

# FileUploadFailed
source: Failed to upload file to storage
es: No se pudo subir el archivo al almacenamiento

# FileDeleteFailed
source: Failed to delete file from storage
es: No se pudo eliminar el archivo del almacenamiento

# FileRetrievalFailed
source: Failed to retrieve file from storage
es: No se pudo recuperar el archivo del almacenamiento

# PresignedUrlGenerationFailed
source: Failed to generate pre-signed URL
es: No se pudo generar la URL pre-firmada

# BucketCreationFailed
source: Failed to create bucket in storage
es: No se pudo crear el bucket en el almacenamiento

# InvalidFile
source: Invalid file object
es: Objeto de archivo inválido

# BucketNameRequired
source: The bucket name is required
es: El nombre del bucket es requerido

# FilePathOrNameRequired
source: Either file path or filename must be provided
es: Se debe proporcionar la ruta o el nombre del archivo

# FileContentRequired
source: The file content (Base64) is required
es: El contenido del archivo (Base64) es requerido

# InvalidBase64Content
source: The file content is not a valid Base64 string
es: El contenido del archivo no es una cadena Base64 válida
